package org.example._2023_06_13;
//Создание и компоновка классов
public class CT3 {
    /**
     * 1:
     * Создайте класс Employee, содержащий информацию о сотрудниках в виде Map<Integer, String>,
     * где ключом является идентификатор сотрудника, а значением - его имя.
     * Создайте метод printEmployees(), который будет перебирать и выводить
     * информацию о сотрудниках, используя цикл for-each и обрабатывая данные внутри метода.
     */


    /**
     * 2:
     * Создайте класс ProductCatalog, содержащий информацию о продуктах в виде Set<String>.
     * Реализуйте метод sortAndPrintCatalog(), который будет перебирать и сортировать
     * информацию о продуктах в алфавитном порядке, используя цикл for-each и Comparable,
     * и выводить отсортированный каталог на экран.
     */
}