package org.example._2023_06_15;

public class DARRAY {
    public static void main(String[] args) {
        int[] a = new int[11];
        int[][] array = new int[5][5];
        int[][] arr = {{1,2,3,4,5},
                       {6,7,8},
                       {11}};

        for (int i = 0; i < array.length; i++) {
            for (int j = 0; j < array[i].length; j++) {

            }
        }

        /**
         * 1. Найти сумму всех элементов в каждой
         * строке двумерного массива и вывести на экран.
         *
         * 2. Найти наибольший элемент в
         * каждом столбце двумерного массива и вывести на экран.
         *
         * 3. Отсортировать каждую строку двумерного массива
         * в порядке возрастания и вывести отсортированный массив на экран.
         *
         * 4. Посчитать количество вхождений определенного
         * числа в каждом столбце двумерного массива и вывести на экран.
         *
         * СНАЧАЛА СОЗДАТЬ МЕТОД КОТОРЫЙ ВОЗВРАЩАЕТ СГЕНЕРИРОВАННЫЙ
         * ДВУМЕРНЫЙ МАССИВ РАНДОМНОЙ ДЛИНЫ И ВЫСОТЫ И С РАНДОМНЫМИ ЧИСЛАМИ
         * ДАЛЕЕ ПЕРЕДАВАТЬ РЕЗУЛЬТАТ РАБОТЫ ЭТОГО МЕТОДА В КАЧЕСТВЕ ПАРАМЕТРА
         */



    }
}
